avg_talk("", "这里是农田，田地里种满了庄稼，田地的尽头有一条土路，通向西边的村庄。")

local function avg_select()
    local options = {
        "庄稼汉",
        "庄稼妇",
        "离开",
    }

    local idx = show_avg_select("", "田地里有一个庄稼汉正在耕地，一个庄稼妇在田埂棚里休息。", options)

    switch(idx) {
        ["1"] = function()
            if is_in_dungeon("了空", "女儿村") then
                avg_talk("司徒来也", "这位大哥，劳驾一问，不知在这村中若是想打听事情，该去找谁呀？")
                avg_talk("[speaker:庄稼汉]", "打听消息？怎么又来一波？你们要打听谁家的姑娘？")
                avg_talk("司徒来也", "听上去，似乎有很多人都来问过？")
                avg_talk("[speaker:庄稼汉]", "最近村里乱得很，不少人家都丢了姑娘，自然是到处求人帮忙找人了。")
            else
                avg_talk("司徒来也", "这位大哥，敢问可见过村里有位叫小红的姑娘？")
                avg_talk("[speaker:庄稼汉]", "小红？听说是前阵子回村了，可我是没真见着。")
            end
            avg_talk("司徒来也", "如此一来，岂不是毫无头绪？")
            avg_talk("[speaker:庄稼汉]", "我庄稼汉除了庄稼，旁得也不知道。可毕竟村里这么大的事，总有人知道些消息。")
            avg_talk("司徒来也", "那我就不打扰你了。")
            avg_select()
        end,
        ["2"] = function()
            if is_in_dungeon("了空", "女儿村") then
                avg_talk("司徒来也", "这位大姐，烦劳询问一下，在这村中若是想打听事情，该去找谁呀？")
                avg_talk("[speaker:庄稼妇]", "你想问些什么事情呢？")
                avg_talk("司徒来也", "我们来这村中，一是受人之托，想问询小红姑娘的下落；二是我们这位小长老，想问问关于他身世的一些事情。")
                avg_talk("[speaker:庄稼妇]", "听着就头大，近来村里乱得很，不少姑娘失踪，多得是你们这种问询下落的。")
                avg_talk("司徒来也", "那岂不是毫无头绪？")
                avg_talk("[speaker:庄稼妇]", "你们问的事，若是跟村里近些时候出的几桩事情有关，与其四处乱走，那倒不如去询问知情的人。")
                avg_talk("司徒来也", "还望大姐说详细些？")
                avg_talk("[speaker:庄稼妇]", "不过你去找村长，这个村子的人和事，他都知道。")
                avg_talk("司徒来也", "好的，谢谢大姐。")
            else
                avg_talk("司徒来也", "这位大姐，烦劳询问一下，可曾见过这村中的小红姑娘？")
                avg_talk("[speaker:庄稼妇]", "啊！小红？你是来找小红的？最近确实有不少外面的人，帮忙寻找失踪的那些女孩，莫非你也是？")
                avg_talk("司徒来也", "我正是受人之托，来找小红姑娘的，不知大姐可有线索？")
                avg_talk("[speaker:庄稼妇]", "最近村子里乱得很，我一个乡下妇人不像你们行走江湖的一身本事，着实帮不上什么，只能多求求老天保佑小红那孩子能平安无事吧。")
                avg_talk("[speaker:庄稼妇]", "不过你去找村长，这个村子的人和事，他都知道。")
                avg_talk("司徒来也", "好的，谢谢大姐。")
            end
            avg_select()
        end,
        ["3"] = function()
            return
        end,
    }
end

avg_select()

set_flag("完成农田")