if has_flag("完成地牢") then
    avg_talk("", "阴暗潮湿的地牢里，滋生了多少罪恶。")
    return
end

avg_talk("", "阴影之中，勉强能见到有少女的身形。她双手被铁链锁住，似是被囚禁许久。仔细分辨，正是白花！")

avg_talk("司徒来也", "白花，我是受你爷爷的委托来救你的。")
avg_talk("[speaker:白花]", "救……救救我……")

avg_talk("", "手起刀落，束缚白花的铁链被砍断。正扶白花起身，却忽然觉察到一阵急促的脚步声从外面传来。")

avg_talk("梁胜", "虎焰门的人，你们终于来了！")
avg_talk("司徒来也", "你是谁？")
avg_talk("梁胜", "虎焰门的小子，不认识你爷爷梁胜了？你狗胆包天，竟敢坏我们豪猪长垄的好事，找死！")

local ret = dungeon_battle("女儿村", "地牢之战")
if ret == 1 then
    avg_talk("梁胜", "臭小子！这次算老子认栽，咱们走着瞧！")
    avg_talk("司徒来也", "白花姑娘，没事吧？")
    avg_talk("[speaker:白花]", "没事……可——")
    avg_talk("", "正想将白花救出时，却发现阴森牢房之中转出一个人，正是小红！白花见到小红却不惊讶，很显然她知道些什么内情。")
    avg_talk("[speaker:白花]", "小红……我们自小一处长大，你为何要这样害我？")
    avg_talk("[speaker:小红]", "哼！是我错估了豪猪长垄那帮废物的本事！可走到这一步，我并不后悔！白花啊白花，事到如今，你都想不明白？")
    avg_talk("[speaker:白花]", "我不明白……")
    avg_talk("[speaker:小红]", "从小到大，我比你差在哪里？为何你就能留在村中，而我就必须去那烟花之地，卖笑为生？就因为你有个当族长的爷爷？你就与众不同？")
    avg_talk("司徒来也", "就算如此，你为何要勾结豪猪长垄，去害女儿村中其他的少女？")
    avg_talk("[speaker:小红]", "哼，都是腌臜地界儿，去哪里又有什么分别？难道泰山姑子、扬州瘦马这些女人都能左右自己的命运吗？她们既然生下来便是被人利用的工具，那还不如被我利用！")
    avg_talk("司徒来也", "你真是疯魔了！")
    avg_talk("[speaker:白花]", "小红！你一心想摆脱被利用的命运，却不知这样的执念才会让你深陷泥潭之中？")
    avg_talk("司徒来也", "算了，这里面的是非曲直，还是由你们村中族长自行判断吧。")
    avg_talk("", "同白花一起带着小红离开地牢，相信族长应该会对这件事做出公平的审判。")
    set_flag("完成地牢")
    set_dungeon_task_result("女儿村", "寻找白花", true)
    set_dungeon_task_result("女儿村", "真相大白", true)
else
    dungeon_fail("女儿村")
end 