avg_talk("", "林深之处，虽然静谧，却也透着未知的神秘。")

if is_in_dungeon("了空", "女儿村") then
    if not has_flag("完成祠堂") then
        avg_talk("了空", "阿弥陀佛，莫非小僧当初，便是在这儿被捡到的？")
    else
        if not has_flag("完成密林") then
            avg_talk("了空", "阿弥陀佛，小僧的身世与当年这密林中抛弃小僧的那人有关。")
            avg_talk("了空", "只是年代久远，逝者不可追，小僧只好念些心经，超度婴灵，为那些人减些罪过。")
            avg_talk("司徒来也", "在下不打扰了……小长老若有事，喊一声便好。")
            avg_talk("", "了空在一棵大树下盘腿而坐，闭上眼睛，双手合十，渐渐入定。")
            avg_talk("", "许久，了空睁开眼睛，站起身来。")
            avg_talk("了空", "阿弥陀佛。")
            avg_talk("了空", "夫男子阳，女子阴，如天地之交融，日月之共生，同一大宇宙之表象，皆由生命之一源而发。")
            avg_talk("了空", "非分离，乃共生，此生死轮回之真谛。以禅者之心，当顾及天地之生机，自然之循环。")
            avg_talk("司徒来也", "简单来说，就是我们不要干预自然的平衡循环，对吧？")
            avg_talk("了空", "施主悟性极佳。")
            avg_talk("司徒来也", "哈哈哈，我也是这么觉得的。")
            change_favor_by_id("司徒来也", 1)
        else
            avg_talk("了空", "夫男子阳，女子阴，如天地之交融，日月之共生，同一大宇宙之表象，皆由生命之一源而发。")
            avg_talk("了空", "非分离，乃共生，此生死轮回之真谛。以禅者之心，当顾及天地之生机，自然之循环。")
            avg_talk("司徒来也", "简单来说，就是我们不要干预自然的平衡循环，对吧？")
            avg_talk("了空", "施主悟性极佳。")
            avg_talk("司徒来也", "哈哈哈，我也是这么觉得的。")
        end
        set_flag("完成密林")
    end
end

if is_in_dungeon("秋", "女儿村") then
    avg_talk("秋", "咦，咋感觉小和尚的身世和我有点像？")
end 