avg_talk("", "茅草屋，屋子里有一张床，一张桌子，一把椅子，一盏油灯。")

if not has_flag("完成马厩") then
    local options = {
        "叫醒老人",
        "离开",
    }

    local idx = show_avg_select("", "屋子里有位老人，正在打瞌睡。", options)

    switch(idx) {
        ["1"] = function()
            avg_talk("司徒来也", "老人家，老人家，醒醒。")
            avg_talk("[speaker:老人]", "嗯？你、你是谁？你怎么进来的？")
            avg_talk("司徒来也", "老人家别怕，我们不是恶人，我们是受人之托来这村子找那位叫做小红的姑娘！不知老人家是？")
            avg_talk("[speaker:老人]", "哦，那你还真是问对人了，我是这儿的村长，前阵子小红确实回来过，只是……")
            avg_talk("司徒来也", "只是什么？莫非老人家知道小红姑娘的去处？")
            avg_talk("[speaker:村长]", "不单单是小红，近来村中不少家的女孩儿都下落不明，因此各家出人出力，寻了些武林侠士来找。只是谁成想，竟有一些是来捣乱的！")
            avg_talk("[speaker:村长]", "他们把守着村中道口，还把马厩给围起来了，村外的人进不来，村里的人也出不去。只是不知道女孩儿们失踪，是不是与他们有关？")
            avg_talk("司徒来也", "这么想，他们确实可疑得很！")
            avg_talk("[speaker:村长]", "真是作孽啊。不过这些人，可不好惹……村里也是敢怒而不敢言啊。")
            avg_talk("司徒来也", "老村长，不如让我们解决这些人吧！")
            set_flag("显示马厩")
            set_dungeon_task_result("女儿村", "解决马厩麻烦", false)
        end,
        ["2"] = function()
            return
        end,
    }
else
    if not has_flag("获得小红线索") then
        avg_talk("司徒来也", "老村长，不必再忧心了，那些歹人已经被解决掉了！")
        avg_talk("[speaker:村长]", "好，好，好！多谢多谢！只是小红虽来过村子，可行踪下落确实是不知，帮不上什么忙。")
        avg_talk("司徒来也", "无碍无碍，便是她出现在村中，已经是十分有用的信息了。")
        set_flag("完成茅草屋")
        if is_in_dungeon("了空", "女儿村") then
            avg_talk("司徒来也", "老村长，在下其实还有个不情之请，同行的有个小长老，想打听些事。")
            avg_talk("[speaker:村长]", "这位小长老但说无妨，定是知无不言！")
            avg_talk("了空", "阿弥陀佛，小僧法名了空，是被师父在村旁密林中捡到的，当时包裹小僧的襁褓上写着“陈”一字。故而想问问这村中可有关于“陈氏”的信息。")
            avg_talk("[speaker:村长]", "哎！作孽啊！与小长老实说了吧，这个村子原本就叫做陈家村，只是后来……后来才改名叫做女儿村的。说来惭愧，村中过去之事，腌臜不堪。若想知道，可以去祠堂找族谱查个分明。")
            avg_talk("了空", "阿弥陀佛，那小僧便去祠堂看看。")
            avg_talk("司徒来也", "我也一同去吧。")
            set_flag("显示密林")
        end
    else
        avg_talk("司徒来也", "老村长你为何要隐瞒“小红姑娘失踪一周”这样重要的信息？")
        avg_talk("[speaker:村长]", "抱歉，并非真心隐瞒，只是受人所托。")
        avg_talk("司徒来也", "如今到这份上了，还有什么不好说的？")
        avg_talk("[speaker:村长]", "许多日前，小红回了村子，她来探望时便说，若是后面她没了音信，便一定在村中贴个寻人的告示。")
        avg_talk("司徒来也", "如此重要的事情，为何不早说！")
        avg_talk("[speaker:村长]", "小红特意嘱咐此事不可泄露，现在想想也是奇怪。莫非她是来村里避祸。")
        avg_talk("司徒来也", "小红姑娘在此之前有没招惹过什么人？")
        avg_talk("[speaker:村长]", "小红回村这件事，除了知根知底的乡亲，旁得也没什么陌生人知晓了。再说她在村中能招惹谁，无非就是和村里的孩子们玩。")
        avg_talk("司徒来也", "既然如此，也算是有了些线索。")
        if not has_flag("完成小红失踪") then
            local flag = get_flag_int("获得小红线索")
            set_flag_int("获得小红线索", flag + 1)
            set_flag("完成小红失踪")
        end
    end
end