
show_stage("门派宫殿.png", "飞星云顶")
play_bgm("Music/.mp3", 0.1)
light_scene(0.2)

local shibing = actor("石冰")
local ao = actor("獒")

--初始化位置和朝向
bright_all_actors()

shibing:setPos(500, 75)
shibing:face_right()
ao:setPos(800, 75)
ao:face_left()

ao:say("阴阳王不愧为朝廷信任的高手，竟能找到我。")
shibing:say("能十几头西山野狼震得尸骨粉碎的，这息风谷中可还有第二人？")
ao:say("呵，想不到原来是被这不堪一击的畜牲出卖了行踪。")
shibing:say("如今息风谷局势被搅得翻天覆地，想必先生也已找到所寻之物。只是不知之前的承诺——")
ao:say("阴阳王所言可是修复玉茎之术？")
shibing:say("自然！当初先生答应此术之秘才从我这里换去那再无旁人知晓的情报。如今既然已经得偿所愿，也该兑现前言了。")
ao:say("阴阳王所求者，皆在火神之树。")
shibing:say("火神之树？竟是火神之树！")
ao:say("火神树的根茎是集乾坤纯阳的神物，这蕴藏于内的力量是世间唯一能达成你心愿之法。")
shibing:say("若想得到火神树，这虎焰门确实不是个好对付……虽然覆灭之后破败不堪，可那后起的几个竟也有些手段。")
ao:say("这法子我告诉你了，只是得与不得，便得看你的本事了。")
shibing:say("虽不知先生所寻“宝物”为何，可见先生因此物不惜对付虎焰门，便知与虎焰门干系颇深。如今虎焰门残焰复燃，只怕对夜郎大人的计划……。")
ao:say("阴阳王此言，只是想借我们的手来压制虎焰门，而后坐收渔利吧？")
shibing:say("彼此彼此，先生将火神树之事告知，何尝不也是一般的想法呢？")
ao:say("呵，阴阳王此话，未免小瞧了夜鸦。")
shibing:say("不敢不敢，我观夜郎大人暗中布划，莫不是要夜鸦做息风谷的地下统治者？如今虎焰门势头正盛，很难对付，若是与飞星云顶互为助力，各取所需岂不美哉？")
ao:say("地下统治者？哈哈哈！夜鸦可是翱翔天际，这息风谷又算什么？若碍了那位大人的事，任是什么来头，三日之内必灰飞烟灭。至于那司徒来也，不过只是还谈不上多余罢了。")
hide_all_stage_bubble()

black_scene(0.25)
hide_stage()
set_flag("完成修阳奇术")
light_scene(0.25)
