avg_talk("", "鹿追领着(player:fullname)一行人，按照书稿的指引，来到了一个被岁月遗忘的地方。这里已有百年无人问津，杂草丛生，洞口被密密麻麻的藤蔓所掩盖，几乎难以辨认。")

if has_flag("完成遗忘之地") then
    return
end

avg_talk("鹿追", "这里便是书稿上所指的遗忘之地了。")
avg_talk("", "众人开始在杂草中仔细搜寻，终于在一处隐蔽之处发现了一个古老的机关，上面有四个形状各异的凹槽。")
avg_talk("司徒来也", "这应该就是书稿上所描述的机关了。我们将四枚令牌放入凹槽中，看看会发生什么。")
add_player_item("有点像钥匙的令牌", -4)
avg_talk("", "(player:fullname)小心翼翼地将四枚令牌放入凹槽，机关缓缓转动，最终洞口缓缓打开，露出了一个通往未知之地的入口。")
avg_talk("", "洞内闪烁着微弱的光芒，仿佛在诉说着古老的秘密。其中放置着一卷神秘的物品。")
avg_talk("司徒来也", "这就是我们一直在寻找的口诀吗？")
avg_talk("", "众人将物品取出，仔细查看，发现上面刻有一段古老的文字。")
avg_talk("鹿追", "手稿的开头写道：“岁炙叶，乃是我炙家族守护神树之精华，每一枚都蕴含着无尽的天地灵气。得此叶者，可得神树之庇佑，心法修炼事半功倍。”")
avg_talk("司徒来也", "我看这上面还写着：“取一枚岁炙叶，置于手心，以真气催动，使其释放灵气。随后，将灵气吸入体内，与自身真气相融合，循环全身经脉。如此反复修炼，可达心法大成之境。”")
avg_talk("", "手稿中还提到了一些注意事项：“修炼之时，需心无旁骛，方能感应到岁炙叶中的灵气。切不可急功近利，否则极易走火入魔。”")
avg_talk("", "最后，手稿留下了一段警示之语：“岁炙叶虽神奇，但非人人可得。若有缘者得之，务必珍惜，传承后世，切勿滥用，以免招致灾祸。”")
avg_talk("司徒来也", "这手稿上记载的应该就是用岁炙叶来修炼《疾风烈焰掌》的方法了。")
avg_talk("鹿追", "(player:fname)公子，既然如此，这手稿就交给你了。")
add_player_item("岁炙叶手稿", 1)

local opts = {
    "邀请鹿追一起回去",
    "自己回去",
}
local i = show_avg_select("", "(player:fullname)对着鹿追说", opts)
switch(i)
{
    ["1"] = function()
        avg_talk("司徒来也", "鹿追姑娘，我们两家有深厚的渊源，你要不要一起回去？我们一起重建虎焰门？")
        avg_talk("鹿追", "(player:fname)公子，我们有缘自会再见。")
        set_flag("完成邀请鹿追")
    end,
    ["2"] = function()
        avg_talk("司徒来也", "鹿追姑娘，虎焰门有事情，我先走了。")
    end,
}
set_flag("完成遗忘之地")
set_flag("完成烈焰之迹")
dungeon_success("烈焰之迹")