avg_talk("", "鹿追领着(player:fullname)一行人，来到了火神之树旁的古老陵墓。陵墓历经岁月沧桑，显得神秘而庄严。墓地的石碑上覆盖着厚厚的青苔，周围环绕着几棵参天的松树，更增添了几分肃穆。")

if has_flag("完成陵墓") then
    return
end

avg_talk("鹿追", "大家小心，这陵墓年代久远，若有阵法，万一惊扰了守护兽，恐怕我们就有危险了。")
avg_talk("齐六哥", "鹿追姑娘放心，我们会万分小心的。")
avg_talk("", "众人小心翼翼地走向陵墓，突然间，一声咯吱响起，一块石头从墓碑上脱落。")
avg_talk("司徒来也", "老六，不是让你不要乱动的吗？")
avg_talk("鹿追", "糟糕，我们触发了阵法。")
avg_talk("司徒来也", "大家小心，有什么东西从地下冒出来了。")

local ret = dungeon_battle("烈焰之迹", "陵墓之战")
if ret == 1 then
    avg_talk("", "鹿追引领(player:fullname)等人穿过陵墓的幽深甬道，来到了内室。内室中，墙壁上布满了凹洞，每个凹洞中都放置着一块牌位，牌位上刻着炙家族历代先祖的名字。")
    avg_talk("鹿追", "这里应该就是我们炙家族的墓地所在了。请诸位见谅，我要为我的家族祈福。")
    avg_talk("", "鹿追在一旁的神龛前跪拜，双手合十，低声祈祷。(player:fullname)一行人也跟着庄重地拜了拜，以示对炙家族先祖的尊敬。")
    avg_talk("", "在内室中搜寻良久，他们终于在一块古老的牌位旁找到了最后一枚令牌。令牌旁边，放置着一本破旧的书稿。")
    add_player_item("有点像钥匙的令牌", 1)
    avg_talk("鹿追", "原来炙家村还有一处我未曾听闻的地方。百年前家族分裂后，便无人再去那里，后来也渐渐被大家遗忘。这本书稿上记载着你们所寻找的心法和物品就在此处，而这枚令牌便是开启那处的钥匙。")
    avg_talk("司徒来也", "姑娘可否带我们前往？")
    avg_talk("鹿追", "请随我来。")
    set_flag("完成陵墓")
else
    dungeon_fail("烈焰之迹")
end